# -*- coding: utf-8 -*-


module REALM
  ONE = %w(阿格拉玛 艾苏恩 黑龙军团 国王之谷 白银之手 红龙军团 安威玛尔 尘风峡谷 卡扎克 达纳斯 黑石尖塔 回音山 库德兰 基尔罗格 奥达曼 卡德罗斯 藏宝海湾 迪托马斯 奥蕾莉亚 暴风祭坛 山丘之王 燃烧平原 蓝龙军团 诺莫瑞根 洛萨 雷霆之王 烈焰峰 萨格拉斯 玛瑟里顿 索瑞森 铜龙军团 普瑞斯托 罗宁 伊瑟拉 死亡之翼 玛多兰 图拉扬 索拉丁 耐萨里奥 冰风岗 寒冰皇冠 激流堡 利刃之拳 古尔丹 达隆米尔 基尔加丹 奥特兰克 暗影议会 阿拉索 艾欧纳尔 巴尔古恩 埃雷达尔 阿尔萨斯 耳语海岸 巨龙之吼 拉格纳洛斯 霜之哀伤 麦迪文 希尔瓦娜斯 玛诺洛斯 影牙要塞 遗忘海岸 斯坦索姆 银月 耐奥祖 克尔苏加德 凯尔萨斯 鹰巢山 血色十字军 瑞文戴尔 通灵学院 提瑞斯法 霜狼 银松森林)
  TWO = %w(风行者 奥拉基尔 暗影之月 阿克蒙德 地狱咆哮 弗塞雷迦 阿迦玛甘 风暴之怒 卡德加 达斯雷玛 地狱之石 火焰之树 埃苏雷格 戈古纳斯 爱斯特纳 艾萨拉 冰霜之刃 埃加洛尔 艾森娜 毁灭之锤 耐普图隆 伊利丹 战歌 梦境之树 夏维安 拉文凯斯 泰兰德 石爪峰 月神殿 闪电之刃 主宰之剑 梅尔加尼 塞纳里奥 玛法里奥 麦维影歌 屠魔山谷 月光林地 海加尔 轻风之语 卡拉赞 安纳塞隆 龙骨平原 熔火之心 阿拉希 克苏恩 安其拉 破碎岭 血羽 黑手军团 巴纳扎尔 黑翼之巢 克洛玛古斯 阿纳克洛斯 雷霆之怒 瓦里玛萨斯 阿努巴拉克 德拉诺 桑德兰 燃烧军团 无尽之海 泰拉尔 海克泰尔 哈卡 范达尔鹿盔 奎尔萨拉斯 洛丹伦 海达希亚 纳克萨玛斯 库尔提拉斯 格瑞姆巴托 森金 奈法利安 拉贾克斯 永恒之井 萨菲隆 古拉巴什 拉文霍德 瓦拉斯塔兹 莱索恩 刀塔 血槌 麦姆 迪门修斯 黑暗之门 深渊之喉 格鲁尔 艾露恩 死亡熔炉 凤凰之神 鲜血熔炉 阿古斯 托尔巴拉德 军团要塞 破碎大厅 祖阿曼 试炼之环 希雷诺斯 末日祷告祭坛 罗曼斯 塞泰克 玛克扎尔 瓦丝琪 摩摩尔 蒸汽地窟 无底海渊 哈兰 翡翠梦境 范克里夫 穆戈尔 雷德 太阳之井)
  THREE = %w(血环 黑暗之矛 符文图腾 迦罗娜 雷霆号角 黄金之路 红龙女王 火羽山 凯恩血蹄 狂风峭壁 雷斧堡垒 鬼雾峰 埃德萨拉 杜隆坦 红云台地 布莱克摩 普罗德摩 诺兹多姆 死亡之门 纳沙塔尔 灰烬使者 羽月 燃烧之刃 雷克萨 玛里苟斯 千针石林 血牙魔王 圣火神殿 禁魔监狱 熊猫酒仙 勇士岛 甜水绿洲 蜘蛛王国 自由之风 萨尔 古加尔 恶魔之魂 埃克索图斯 黑铁 艾莫莉丝 加基森 巴瑟拉斯 菲拉斯 恐怖图腾 血顶 格雷迈恩 达文格尔 迪瑟洛克 丹莫德 艾维娜 阿扎达斯 布莱恩 灰谷 阿卡玛 加里索斯 祖鲁希德 塞拉赞恩 大漩涡 逐日者 伊莫塔尔 奥斯里安 祖尔金 托塞德林 黑暗虚空 塔纳利斯 外域 维克尼拉斯 奥妮克希亚 安戈洛 荆棘谷 诺森德 天空之墙 瑟莱德丝 风暴之鳞)
  FIVE= %w(黑暗魅影 世界之树 加兹鲁维 狂热之刃 卡珊德拉 斩魔者 万色星辰 苏塔恩 守护之剑 浸毒之骨 布兰卡德 恶魔之翼 水晶之刺 迅捷微风 激流之傲 雏龙之翼 玛格索尔 日落沼泽 神圣之歌 大地之怒 朵丹尼尔 伊森利恩 安多哈尔 法拉希姆 踏梦者 伊萨里奥斯 金色平原 暮色森林 永夜港 密林游侠 风暴之眼 午夜之镰 提尔之手 芬里斯 元素之力 加德纳尔 噬灵沼泽 莫什奥格 深渊之巢 邪恶颅壳 冰川之拳 幽暗沼泽 火烟之谷 戈杜尼 米奈希尔 伊兰尼库斯 莫格莱尼 迦玛兰 火喉 金度 刺骨利刃 巫妖之王 耐克鲁斯 岩石巨塔 风暴裂隙 石锤 塞拉摩 伊森德雷 冬泉谷 烈焰荆棘 瑟玛普拉格 亚雷戈斯 夺灵者 扎拉赞恩)
  TEN = %w(阿斯塔洛 安苏 阿比迪斯 戈提克 菲米丝 末日行者 加尔 熵魔 达尔坎 盖斯 迦顿 能源舰 阿曼尼 贫瘠之地 达基萨斯 白骨荒野 布鲁塔卢斯 血吼 壁炉谷 生态船 莉亚德琳 萨贝里安 嚎风峡湾 玛洛加尔 奥尔加隆 影之哀伤 斯克提斯 玛格曼达 奎尔丹纳斯 莫加尔 霍格 沙怒 远古海滩 安加萨 织亡者 黑锋哨站 达克萨隆 安格博达 莫德雷萨 风暴峭壁 萨塔里奥 冬拥湖 洛肯 古达克 迦拉克隆)

  SERVER = [["一区", ONE], ["二区", TWO], ["三区", THREE], ["五区", FIVE], ["十区", TEN]]
end
